; domain
;; Adapted from: https://github.com/josej30/Planner-Sat-Constraints
;; We use existential preconditions (exists) to remove as many parameters from the actions as possible

(define (domain logistics-strips) ;; Actually, this domain is not strips, but I use that name so that it matches the domain name of the problems generated

(:requirements :strips :typing :existential-preconditions) 

(:types  city location thing - object
         package vehicle - thing
         truck airplane - vehicle  
         airport - location)
  
(:predicates  (in-city ?l - location ?c - city)
              (at ?obj - thing ?l - location)
              (in ?p - package ?veh - vehicle))
  
(:action drive
         :parameters    (?t - truck ?from ?to - location)
         :precondition  (and 
                             (at ?t ?from)
                             (exists (?c - city)
                                (and (in-city ?from ?c) (in-city ?to ?c))
                              )
                         )
         :effect        (and (not (at ?t ?from))
                             (at ?t ?to)))

(:action fly
         :parameters    (?a - airplane ?from ?to - airport)
         :precondition  (at ?a ?from)
         :effect        (and (not (at ?a ?from))
                             (at ?a ?to)))

(:action load
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (at ?p ?l))
         :effect        (and (not (at ?p ?l))
                             (in ?p ?v)))

(:action unload
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (in ?p ?v))
         :effect        (and (not (in ?p ?v))
                             (at ?p ?l)))

)

; problem
(define (problem logistics-c2-s5-p2-a3)
(:domain logistics-strips)
(:objects a0 a1 a2 - airplane
          c0 c1 - city
          t0 t1 t2 t3 t4 - truck
          l0-0 l1-0 - airport
          l0-1 l0-2 l0-3 l0-4 l1-1 l1-2 l1-3 l1-4 - location
          p0 p1 - package
)
(:init
    (in-city  l0-0 c0)
    (in-city  l0-1 c0)
    (in-city  l0-2 c0)
    (in-city  l0-3 c0)
    (in-city  l0-4 c0)
    (in-city  l1-0 c1)
    (in-city  l1-1 c1)
    (in-city  l1-2 c1)
    (in-city  l1-3 c1)
    (in-city  l1-4 c1)
    (at t0 l0-4)
    (at t1 l1-1)
    (at t2 l0-0)
    (at t3 l1-4)
    (at t4 l1-2)
    (at p0 l1-2)
    (at p1 l1-0)
    (at a0 l1-0)
    (at a1 l1-0)
    (at a2 l0-0)
)
(:goal
    (and
        (at p0 l1-0)
        (at p1 l0-3)
    )
)
)

; plan
1. (load t4 p0 l1-2)
   deleted: (at p0 l1-2)
   added: (in p0 t4)
   goals met: 0 of 2
2. (drive t4 l1-2 l1-0)
   deleted: (at t4 l1-2)
   added: (at t4 l1-0)
   goals met: 0 of 2
3. (unload t4 p0 l1-0)
   deleted: (in p0 t4)
   added: (at p0 l1-0)
   goals met: 1 of 2
4. (load a1 p1 l1-0)
   deleted: (at p1 l1-0)
   added: (in p1 a1)
   goals met: 1 of 2
5. (fly a1 l1-0 l0-0)
   deleted: (at a1 l1-0)
   added: (at a1 l0-0)
   goals met: 1 of 2
6. (unload a1 p1 l0-0)
   deleted: (in p1 a1)
   added: (at p1 l0-0)
   goals met: 1 of 2
7. (load t2 p1 l0-0)
   deleted: (at p1 l0-0)
   added: (in p1 t2)
   goals met: 1 of 2
8. (drive t2 l0-0 l0-3)
   deleted: (at t2 l0-0)
   added: (at t2 l0-3)
   goals met: 1 of 2
9. (unload t2 p1 l0-3)
   deleted: (in p1 t2)
   added: (at p1 l0-3)
   goals met: 2 of 2
